/*
На языке программирования C (стандарт C99 и выше) реализовать приложение, 
принимающее в качестве аргументов командной строки путь к текстовому файлу. 
Файловая переменная, полученная при открытии файла, должна быть передана в функцию, 
принимающую также переменное число аргументов (непустых строк). 
В файле необходимо найти вхождения всех строк из списка аргументов переменной длины в качестве подстрок,
и напечатать в стандартный поток вывода номера символов из файла (начиная с 1) 
с указанием всех подстрок, начинающихся с данного символа.
 */



 